#4 задача. Робота світлофора для водіїв запрограмована таким чином: на початку кожної
#години протягом трьох хвилин горить зелений сигнал, потім протягом однієї хвилини -
#жовтий, протягом двох хвилин - червоний, протягом трьох хвилин - знову зелений і т. д.
#Розробити програму, яка вводить дійсне число t, що означає час в хвилинах, що
#минув з початку чергової години і визначає сигнал якого кольору горить для водіїв в цей
#момент.
#Петухов Єгор Б19_д/122Б
while True:
    while True:
        try:
            t = int(input('Введіть час: '))
            break
        except ValueError:
            print('Тільки числа')
    if t < 0 or t > 60:
        print('Введено неправильна кількість хвилин,введіть до 60 хвилин')
    else:
        a = t % 6
        if 1 <= a <= 3:
            print('Горить зелений')
        elif a == 4:
            print('Горить жовтий')
        else:
            print('Горить червоний')
        result=input('Хочете ще раз ввести час? якщо так натисніть 1, а якщо ні будь яку іншу кнопку: ')
        if result == '1':
            continue
        else:
            break